app/views/admin/items/edit.html.erb

            <br>
            <%= f.collection_select :genre_id, Genre.all, :id, :name %><br>
---
SELECT "genres".* FROM "genres"