app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
            <br>
            <%= f.collection_select :genre_id, Genre.all, :id, :name %><br>