app/controllers/admin/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "last_name" = ?, "first_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?
---
  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)