app/controllers/admin/genres_controller.rb

  def index
    @genre = Genre.new
    @genres = Genre.all.page(params[:page]).reverse_order
---
SELECT  "genres".* FROM "genres" ORDER BY "genres"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]