app/controllers/admin/homes_controller.rb

  def top #管理者トップページ(注文履歴一覧)
    @orders = Order.all.page(params[:page]).reverse_order
---
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]