app/controllers/admin/items_controller.rb

INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "genre_id" = ?, "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["genre_id", 2], ["image_id", "1d2a7d4aa7cc52bd29b4563ed707eaf7a4eb78e8d61e49b5db122c0a6fdb"], ["updated_at", "2021-10-26 13:51:32.791103"], ["id", 2]]
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)