app/controllers/admin/order_details_controller.rb

  def update
    # @order_detail = OrderDetail.find(params[:id])
    # if @order_detail.update(order_detail_params)
    #     flash[:notice] = "製作ステータスを変更しました"
    #     redirect_to admin_order_path(@order_detail.order.id)
    # else
    #     render :show
    # end

    @order_detail = OrderDetail.find(params[:id])
    @order = @order_detail.order
    @order_detail.update(order_detail_params)
      if @order_detail.making?
        @order.making!
        # ↓order_detailsの数とmaking_statusがfinishになった数が同じ時
      elsif @order.order_details.count == @order.order_details.where(making_status: "finish").count
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 2], ["updated_at", "2021-10-31 06:52:08.028057"], ["id", 5]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 2], ["updated_at", "2021-10-30 09:26:36.249869"], ["id", 4]]
SELECT COUNT(*) FROM "order_details" WHERE "order_details"."order_id" = ? AND "order_details"."making_status" = ?  [["order_id", 5], ["making_status", 3]]