app/controllers/admin/orders_controller.rb

  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 2]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
  #   @order = Order.find(params[:id])
  #   if @order.update(order_params)
  #     flash[:notice] = "注文ステータスを変更しました"
  #     redirect_to admin_order_path
  #   else
  #     render :show
  #   end
  # end

    @order = Order.find(params[:id])
    @order_details = @order.order_details
    if @order.update(order_params)
      if @order.paid?
        @order_details.each do |order_detail|
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 3]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 1], ["updated_at", "2021-10-30 12:30:05.446217"], ["id", 4]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 0], ["updated_at", "2021-10-30 08:28:56.972923"], ["id", 3]]