app/views/admin/orders/show.html.erb

        <p>
          購入者：<%= @order.customer.last_name %><%= @order.customer.first_name %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

                <%= form_with model:order_detail, url: admin_order_path, local:true do |f| %>
                  <%= f.select :making_status, OrderDetail.making_statuses_i18n.invert %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 3]]