app/controllers/public/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def index
    @cart_items = current_customer.cart_items.all

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 1], ["created_at", "2021-10-25 14:39:00.586858"], ["updated_at", "2021-10-25 14:39:00.586858"]]
---
  def create
    @cart_item = CartItem.new(cart_item_params)
    @cart_items = current_customer.cart_items.all
    @cart_items.each do |cart_item|
      if cart_item.item_id == @cart_item.item_id
        new_amount = cart_item.amount + @cart_item.amount
        cart_item.update(amount: new_amount)
        @cart_item.delete
      end
    end
    @cart_item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2021-10-31 11:03:38.506475"], ["id", 12]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    #@cart_item.update(amount: params[:cart_item][:amount].to_i)
    @cart_item.update(cart_item_params)

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 5]]
---
  def all_destroy
    @cart_items = current_customer.cart_items
    @cart_items.destroy_all