app/controllers/public/customers_controller.rb

UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 1], ["updated_at", "2021-10-27 12:30:50.547075"], ["id", 1]]
---
  def out #顧客の退会処理(ステータスの更新)
    @customer = current_customer
    @customer.update(is_active: true)