app/controllers/public/items_controller.rb

SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @items = Item.all.page(params[:page])