app/controllers/public/orders_controller.rb

  def show #注文履歴詳細画面
    @order = Order.find(params[:_id])
    @order_details = @order.order_details
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]