app/controllers/public/orders_controller.rb

  def confirm #注文情報確認画面
    @order = Order.new(order_params)
    #自身の住所
    if params[:order][:select_address_method] == "1"
      @order.postal_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.last_name + current_customer.first_name
    #登録の住所
    elsif params[:order][:select_address_method] == "2"
      @address = Address.find(params[:order][:address_id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create #注文確定処理
    @cart_items =current_customer.cart_items.all
    @order = current_customer.orders.new(order_params)
    if @order.save
      @cart_items.each do |cart_item|
        order_detail = OrderDetail.new
        order_detail.item_id = cart_item.item_id
        order_detail.order_id = @order.id
        order_detail.amount = cart_item.amount
        order_detail.price = cart_item.item.price
        order_detail.save
      end
      redirect_to thanks_orders_path
      @cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "total_payment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "order_details" ("item_id", "order_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", 1], ["order_id", 1], ["price", 600], ["amount", 1], ["created_at", "2021-10-25 15:02:35.555210"], ["updated_at", "2021-10-25 15:02:35.555210"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]

  def index #注文履歴画面
    #@orders = Order.all
    @orders = current_customer.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 2]]

  def show #注文履歴詳細画面
    @order = Order.find(params[:id])
    @order_details = @order.order_details
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]