app/controllers/public/shipping_addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index #配送先登録/一覧画面
   @shipping_addresses = Address.all

INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "佐野美世"], ["postal_code", "4008501"], ["address", "山梨県甲府市丸の内1-6-1"], ["created_at", "2021-10-25 14:26:15.548040"], ["updated_at", "2021-10-25 14:26:15.548040"]]
---
  def create #配送先の登録
    @shipping_addresses = Address.all
    @shipping_address = Address.new(shipping_address_params)
    @shipping_address.customer_id = current_customer.id
    if @shipping_address.save